Tekla.Structures.Drawing.DotPrintAreaType
The print area type.

Tekla.Structures.Drawing.DotPrintAreaType.EntireDrawing
Print entire drawing.

Tekla.Structures.Drawing.DotPrintAreaType.VisibleArea
Print visible area.